---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.MultipleArcsMustOverlap
source: html/19653fbd-43e2-7d9b-7fc5-9a881bf39dfa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.MultipleArcsMustOverlap Property

Multiple arcs are supported only if they are concentric and form a circle with an overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultipleArcsMustOverlap { get; }
```